Tekla Open API Reference for Tekla Structures 2025
Polycurve.GetEnumerator Method
 This method implements the IEnumerable interface
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IEnumerator<ICurve> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of ICurve)
Return Value
Type: IEnumerator<ICurve>
Enumerator of the geometry list
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
Polycurve Class
Tekla.Structures.Geometry3d Namespace